cf_billing/DataProcessors/энргИнструментыНачисленийПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргИнструментыНачисленийПени</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкаНачалаРасчетаПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкаНачалаРасчетаПени</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодНачалаУчетаПени</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодНачалаУчетаДолга</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеНачислятьПениПриОтсутствииДолгаНаКонецПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкаРасчетаПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкаРасчетаПени</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаРасчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетПоТекущейСтавке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкиНачисленияПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкиНачисленияПени</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГлубинаОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайнийСрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяГлубинаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьНаТекущуюДату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСтавкиРефинансирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСтавкиРефинансирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчетыПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоМесяцам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкиРасчетаПениПоУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкиРасчетаПениПоУслугам</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеНачислятьПеню</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргОстановкаРасчетаПениАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргОстановкаРасчетаПениАбонента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеРассчитыватьПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргАвансыИспользованные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргАвансыИспользованные</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПеня</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачисление</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеМКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/DataProcessors/энргИнструментыНачисленийПени/Ext/ObjectModule.bsl
#Область ОписаниеПеременных

#Область Основные

Перем Организация; 
Перем ПериодНачисления; 
Перем Район; 
Перем МКД; 
Перем Абонент; 
Перем Документ;

Перем Ошибки;

#КонецОбласти

#Область Служебные

Перем ПредставлениеРайон;

Перем РассчитыватьНаТекущуюДату;
Перем ТекущаяДатаНачислений;
Перем НачалоСледующегоДняПослеТекущейДатыНачислений;
Перем ГраницыПериодаНачисления;
Перем НачалоРасчетаПени;
Перем НачалоУчетаДолга;
Перем НеНачислятьПениПриОтсутствииДолгаНаКонецПериода;
Перем МаксЗначениеСтатика;
Перем РасчетПоТекущейСтавке;
Перем НастройкиРасчетаПениОтДо;
Перем НастройкиРасчетаПени;
Перем РангКоэффициента;

Перем КонецПериода;
Перем СтавкиНаПериод;
Перем ГлубинаОтсрочки;
Перем КрайнийСрокОплаты;
Перем МаксимальнаяГлубинаЗадолженности;
Перем СменаСтавкиВПериодеСтатика;

Перем ОсновнойЗапрос;
Перем МКДКНачислению;
	
#КонецОбласти

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Начисляет пеню.
//
// Параметры:
//  ВходныеПараметры	-	Структура	-	см. Обработка.энргИнструментыНачисленийПени.НовыеВходныеПараметры.
//
Процедура НачислитьПеню(ВходныеПараметры) Экспорт
	
	Если НЕ РазрешеноВыполнятьОперацию(ВходныеПараметры) Тогда 
		Возврат;
	КонецЕсли;
	
	ИнициализироватьОбщиеДанные(ВходныеПараметры);
	Если ГраницыПериодаНачисления.ПериодНачисления > НачалоМесяца(ТекущаяДатаНачислений) Тогда
		Возврат;
	КонецЕсли;
	
	Ошибки = Новый Массив;
	ПрочитатьНастройки();
	
	Если ПериодНачисления < НачалоРасчетаПени Или ПериодНачисления < НачалоУчетаДолга Тогда 
		Возврат;
	КонецЕсли;
	
	ОсновнойЗапрос = Новый Запрос;
	ОсновнойЗапрос.Текст = ВернутьТекстЗапросаНачисленияПени();	
	
	МКДКНачислению = Новый ТаблицаЗначений;
	МКДКНачислению.Колонки.Добавить("МКД", Новый ОписаниеТипов("СправочникСсылка.энргСтроения"));
	МКДКНачислению.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаЧисло(15));
	МКДКНачислению.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(150));	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргСтроения.Ссылка КАК МКД,
	|	энргСтроения.Код КАК Код,
	|	энргСтроения.Наименование КАК Наименование
	|ИЗ
	|	Справочник.энргСтроения КАК энргСтроения
	|ГДЕ
	|	&Фильтр
	|
	|УПОРЯДОЧИТЬ ПО
	|	МКД";
	
	
	Фильтр = "энргСтроения.Ссылка В(&МКД)";
	
	Если МКД = Неопределено Тогда
		
		Фильтр = "
		|	энргСтроения.ПометкаУдаления = ЛОЖЬ
		|	И энргСтроения.Район = &Район
		|	И энргСтроения.ТипСтроения = &ТипСтроения
		|	И энргСтроения.Организация = &Организация";
		
	КонецЕсли;	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Фильтр", Фильтр);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("ТипСтроения", Перечисления.энргТипыСтроений.МКД);
	Запрос.УстановитьПараметр("МКД", МКД);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	КоличествоПотоков = 7;
	ОбщееКоличество = Выборка.Количество();		
	Если ОбщееКоличество <= КоличествоПотоков Тогда 
		Порция = ОбщееКоличество;
	Иначе 
		Порция = Цел(ОбщееКоличество / КоличествоПотоков);
		Если (ОбщееКоличество % КоличествоПотоков) > 0 Тогда			
			Порция = Порция + 1;
		КонецЕсли;
	КонецЕсли;	
	
	МКДКНачислению.Очистить();
	Итерация = 0;
	ИтерацияПотока = 1;
	Пока Выборка.Следующий() Цикл
		
		Если Итерация = Порция И ИтерацияПотока < КоличествоПотоков Тогда
			
			Начислить();
			
			МКДКНачислению.Очистить();
			Итерация = 0;
			ИтерацияПотока = ИтерацияПотока + 1;
			
		КонецЕсли;
		
		НоваяСтрока = МКДКНачислению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Итерация = Итерация + 1;
	КонецЦикла;
	
	Если Итерация > 0 Тогда
		Начислить();
	КонецЕсли;	
	
	НачислитьЧастныйСектор();
	
	СписокМКД = МКД;
	Если ТипЗнч(МКД) = Тип("СправочникСсылка.энргСтроения") Тогда
		СписокМКД = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МКД);
	КонецЕсли;	
		
	ПараметрыОперацииВЗ = Новый Структура("Организация,ПериодНачисления,Район,МКД,Абонент,СписокМКД", Организация, ПериодНачисления, Район,,, СписокМКД);
	энргРаботаСПоследовательностями.ВосстановитьПоследовательностьВзаиморасчеты(ПараметрыОперацииВЗ, Истина);
	
	Если Ошибки.Количество() > 0 Тогда
		
		ТекстИсключения = СтрСоединить(Ошибки, Символы.ПС);
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает новые входные параметры процедуры "НачислитьПеню".
//
// Возвращаемое значение:
//  Структура: 
//   * Организация		-	Справочники.Организации				-	организация.
//   * ПериодНачисления	-	Дата								-	период расчета.
//   * Район			-	Справочники.энргЗоныОтвественности	-	район.
//   * МКД				-	Справочники.энргСтроения			-	МКД.
//   * Абонент			-	Неопределено						-	не используется.
//   * Документ			-	Неопределено						-	не используется.
//
Функция НовыеВходныеПараметры() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Организация", Справочники.Организации.НашаОрганизация);
	Результат.Вставить("ПериодНачисления", Дата(1,1,1));
	Результат.Вставить("Район", Справочники.энргЗоныОтвественности.ПустаяСсылка());
	Результат.Вставить("МКД", Неопределено);
	Результат.Вставить("Абонент", Неопределено);
	Результат.Вставить("Документ", Неопределено);
	
	Возврат Результат;	
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Валидация

Функция РазрешеноВыполнятьОперацию(ПроверяемыеПоля)
	
	Если НЕ ЗначениеЗаполнено(ПроверяемыеПоля.ПериодНачисления) ИЛИ НЕ ЗначениеЗаполнено(ПроверяемыеПоля.Район) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектПроверки = Документы.энргРегистрацияПоказанийАбонента.СоздатьДокумент();
	ОбъектПроверки.Организация = ПроверяемыеПоля.Организация;
	ОбъектПроверки.Дата	= ПроверяемыеПоля.ПериодНачисления;
	ОбъектПроверки.Район = ПроверяемыеПоля.Район;
	
	Отказ = энргДатыЗапретаИзмененияПереопределяемый.ЗапрещеноИзменятьДанные(ОбъектПроверки);
		
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Для пользователя " + Пользователи.ТекущийПользователь() + 
			" район " + ПроверяемыеПоля.Район + " период " + ПроверяемыеПоля.ПериодНачисления + 
			" закрыт для редактирования");
	КонецЕсли; 		
	
	
	Отказ = НЕ Константы.энргНачислятьПеню.Получить();
	
	Возврат НЕ Отказ;
	
КонецФункции

#КонецОбласти

#Область Настройки

Процедура ИнициализироватьОбщиеДанные(ВходныеПараметры)
	
	РассчитыватьНаТекущуюДату = Ложь;	
	ТекущаяДатаНачислений = ТекущаяДата();
	НачалоСледующегоДняПослеТекущейДатыНачислений = НачалоДня(ТекущаяДатаНачислений + 86400);
	
	Организация = ВходныеПараметры.Организация;
	ПериодНачисления = ВходныеПараметры.ПериодНачисления;
	Район = ВходныеПараметры.Район;
	ПредставлениеРайон = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Район, "Наименование");
	МКД = ВходныеПараметры.МКД;
	Абонент = ВходныеПараметры.Абонент;
	Документ = ВходныеПараметры.Документ;
	
	ГраницыПериодаНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(
		Организация, 
		Район,
		ПериодНачисления,
		Ложь);	
		
	КонецПериода = ГраницыПериодаНачисления.ЗавершениеОП;
	
КонецПроцедуры

Процедура ПрочитатьНастройки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргНастройкаНачалаРасчетаПениСрезПоследних.Организация КАК Организация,
	|	энргНастройкаНачалаРасчетаПениСрезПоследних.ПериодНачалаУчетаПени КАК ПериодНачалаУчетаПени,
	|	энргНастройкаНачалаРасчетаПениСрезПоследних.ПериодНачалаУчетаДолга КАК ПериодНачалаУчетаДолга,
	|	энргНастройкаНачалаРасчетаПениСрезПоследних.НеНачислятьПениПриОтсутствииДолгаНаКонецПериода КАК НеНачислятьПениПриОтсутствииДолгаНаКонецПериода
	|ИЗ
	|	РегистрСведений.энргНастройкаНачалаРасчетаПени.СрезПоследних(, Организация = &Организация) КАК энргНастройкаНачалаРасчетаПениСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкаРасчетаПениСрезПоследних.НастройкаРасчета КАК НастройкаРасчета,
	|	энргНастройкаРасчетаПениСрезПоследних.РасчетПоТекущейСтавке КАК РасчетПоТекущейСтавке
	|ИЗ
	|	РегистрСведений.энргНастройкаРасчетаПени.СрезПоследних(&Период, Организация = &Организация) КАК энргНастройкаРасчетаПениСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргНастройкиНачисленияПениСрезПоследних.ГлубинаОтсрочки КАК ГлубинаОтсрочки,
	|	энргНастройкиНачисленияПениСрезПоследних.КрайнийСрокОплаты КАК КрайнийСрокОплаты,
	|	энргНастройкиНачисленияПениСрезПоследних.МаксимальнаяГлубинаЗадолженности КАК МаксимальнаяГлубинаЗадолженности,
	|	энргНастройкиНачисленияПениСрезПоследних.РассчитыватьНаТекущуюДату КАК РассчитыватьНаТекущуюДату
	|ИЗ
	|	РегистрСведений.энргНастройкиНачисленияПени.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргНастройкиНачисленияПениСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ГраницыПериодаНачисления.ЗавершениеОП - 1);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатЗапроса[0].Пустой() тогда
		
		Комментарий = "Не заполнена информация по началу расчета пени,
		|	 Начисление пени не может быть выполнено";
		
		ВызватьИсключение Комментарий;
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	НачалоРасчетаПени 	= Выборка.ПериодНачалаУчетаПени;
	НачалоУчетаДолга 	= Выборка.ПериодНачалаУчетаДолга;
	НеНачислятьПениПриОтсутствииДолгаНаКонецПериода = Выборка.НеНачислятьПениПриОтсутствииДолгаНаКонецПериода;
	
	Если РезультатЗапроса[1].Пустой() тогда
		
		Комментарий = "Не заполнены настройки расчет пени,
		|	 Начисление пени не может быть выполнено";
		
		ВызватьИсключение Комментарий;
		
	КонецЕсли;
	Выборка = РезультатЗапроса[1].Выбрать();
	Выборка.Следующий();
	
	// Расчет по текущей ставке реф.
	РасчетПоТекущейСтавке = Выборка.РасчетПоТекущейСтавке;
	
	НастройкиРасчетаПени = Выборка.НастройкаРасчета.Получить();
	
	МаксЗначениеСтатика = 0;
	НастройкиРасчетаПениОтДо = Новый Соответствие;
	РангКоэффициента = 1;
	Для каждого Строка Из НастройкиРасчетаПени Цикл
		Если Строка.До = 0 Тогда
			
			НСтр = Новый Структура;
			НСтр.Вставить("Числитель", Строка.Числитель);
			НСтр.Вставить("Знаменатель", Строка.Знаменатель);
			НСтр.Вставить("РангКоэффициента", РангКоэффициента);
			
			НастройкиРасчетаПениОтДо.Вставить(Строка.До, НСтр);
			
		Иначе
			Для Сч = Строка.От По Строка.До Цикл
				
				НСтр = Новый Структура;
				НСтр.Вставить("Числитель", Строка.Числитель);
				НСтр.Вставить("Знаменатель", Строка.Знаменатель);
				НСтр.Вставить("РангКоэффициента", РангКоэффициента);		
				НастройкиРасчетаПениОтДо.Вставить(Сч, НСтр);	
				
				МаксЗначениеСтатика = Макс(МаксЗначениеСтатика, Сч);
				
			КонецЦикла;
		КонецЕсли;
		
		РангКоэффициента = РангКоэффициента + 1;
	КонецЦикла;	
	
	
	НастройкиСтавокРефинансирования = ПолучитьСтавкиРефинансирования();
	Если НастройкиСтавокРефинансирования.Пустой() Тогда 
		
		Комментарий = "Не заполнена информация по ставке рефинансирования,
		|	 Начисление пени не может быть выполнено";		
		ВызватьИсключение Комментарий;
		
	КонецЕсли;
	
	Если РезультатЗапроса[2].Пустой() Тогда 
		
		Комментарий = "Не заполнены настройки начисления пени, Начисление пени не может быть выполнено";		
		ВызватьИсключение Комментарий;
		
	КонецЕсли;
	Выборка = РезультатЗапроса[2].Выбрать();
	Выборка.Следующий();
	ГлубинаОтсрочки 					= Выборка.ГлубинаОтсрочки;
	КрайнийСрокОплаты 					= Выборка.КрайнийСрокОплаты;
	МаксимальнаяГлубинаЗадолженности 	= Выборка.МаксимальнаяГлубинаЗадолженности;

	Если ТекущаяДатаНачислений < ГраницыПериодаНачисления.ЗавершениеОП И ТекущаяДатаНачислений > ГраницыПериодаНачисления.НачалоОП Тогда
		
		Если Выборка.РассчитыватьНаТекущуюДату Тогда
			
			РассчитыватьНаТекущуюДату = Истина;
			
			ГраницыПериодаНачисления.ЗавершениеОП = НачалоДня(ТекущаяДатаНачислений);
			ГраницыПериодаНачисления.ДнейВПериоде = (ГраницыПериодаНачисления.ЗавершениеОП - ГраницыПериодаНачисления.НачалоОП) / (60 * 60 * 24);
			
		КонецЕсли;
		
	КонецЕсли;
	
	СменаСтавкиВПериодеСтатика = СменаСтавкиВПериоде();
	
КонецПроцедуры

Функция ПолучитьСтавкиРефинансирования()
	
	МВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ; 
	Запрос.Текст =
		"ВЫБРАТЬ
		|	энргСтавкиРефинансированияСрезПоследних.Коэффициент КАК Коэффициент,
		|	&НачалоОП КАК Период
		|ПОМЕСТИТЬ СтавкиРефинансированияНабор
		|ИЗ
		|	РегистрСведений.энргСтавкиРефинансирования.СрезПоследних(&НачалоОП, Организация = &Организация) КАК энргСтавкиРефинансированияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтавкиРефинансированияНаборЛево.Период КАК ПериодС,
		|	СтавкиРефинансированияНаборЛево.Коэффициент КАК ЗначениеСтавкиРефинансирования,
		|	МИНИМУМ(ЕСТЬNULL(СтавкиРефинансированияНабор.Период, &ЗавершениеОП)) КАК ПериодПо
		|ПОМЕСТИТЬ СтавкиНаПериод
		|ИЗ
		|	СтавкиРефинансированияНабор КАК СтавкиРефинансированияНаборЛево
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтавкиРефинансированияНабор КАК СтавкиРефинансированияНабор
		|		ПО СтавкиРефинансированияНаборЛево.Период < СтавкиРефинансированияНабор.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	СтавкиРефинансированияНаборЛево.Период,
		|	СтавкиРефинансированияНаборЛево.Коэффициент";
	
	Запрос.УстановитьПараметр("НачалоОП", 		ГраницыПериодаНачисления.НачалоОП);
	Запрос.УстановитьПараметр("ЗавершениеОП", 	ГраницыПериодаНачисления.ЗавершениеОП);
	Запрос.УстановитьПараметр("Организация", 	Организация);	
	Запрос.Выполнить(); 	
	
	СтавкиНаПериод = МВТ.Таблицы["СтавкиНаПериод"].ПолучитьДанные().Выгрузить(); 
	Результат = МВТ.Таблицы["СтавкиРефинансированияНабор"].ПолучитьДанные();

	МВТ.Закрыть();	
	Возврат Результат; 	
	
КонецФункции

Функция СменаСтавкиВПериоде()
	
	Результат = Новый Структура();
	Результат.Вставить("ЕстьСмена", Ложь);
	Результат.Вставить("Период", Неопределено);
	Результат.Вставить("Коэффициент", Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргСтавкиРефинансирования.Период КАК Период,
		|	энргСтавкиРефинансирования.Коэффициент КАК Коэффициент
		|ИЗ
		|	РегистрСведений.энргСтавкиРефинансирования КАК энргСтавкиРефинансирования
		|ГДЕ
		|	энргСтавкиРефинансирования.Организация = &Организация
		|	И энргСтавкиРефинансирования.Период МЕЖДУ &НП И &КП";
	
	Запрос.УстановитьПараметр("КП", ГраницыПериодаНачисления.ЗавершениеОП-1);
	Запрос.УстановитьПараметр("НП", ГраницыПериодаНачисления.НачалоОП);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		Результат.ЕстьСмена = Истина;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЧтениеДанных

Функция ВернутьТекстЗапросаНачисленияПени() 
	
	Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСтавкиНаПериод.ПериодС КАК ПериодС,
	|	ТаблицаСтавкиНаПериод.ЗначениеСтавкиРефинансирования КАК ЗначениеСтавкиРефинансирования,
	|	ТаблицаСтавкиНаПериод.ПериодПо КАК ПериодПо
	|ПОМЕСТИТЬ СтавкиНаПериод
	|ИЗ
	|	&ТаблицаСтавкиНаПериод КАК ТаблицаСтавкиНаПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСтроения.МКД КАК МКД,
	|	энргСтроения.Код КАК Код,
	|	энргСтроения.Наименование КАК Наименование
	|ПОМЕСТИТЬ МКДКНачислению
	|ИЗ
	|	&МКДКНачислению КАК энргСтроения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";	
	
	Если НеНачислятьПениПриОтсутствииДолгаНаКонецПериода Тогда
		Текст = Текст + 
		"ВЫБРАТЬ
		|	энргВзаиморасчетыПоМесяцамОстатки.Район КАК Район,
		|	энргВзаиморасчетыПоМесяцамОстатки.МКД КАК МКД,
		|	энргВзаиморасчетыПоМесяцамОстатки.Абонент КАК Абонент,
		|	энргВзаиморасчетыПоМесяцамОстатки.Услуга КАК Услуга,
		|	СУММА(энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток) КАК СуммаОстаток
		|ПОМЕСТИТЬ АбонентыСДолгамиНаКонецПериода
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И Район = &Район
		|				И МКД В
		|						(ВЫБРАТЬ
		|							МКДКНачислению.МКД
		|						ИЗ
		|							МКДКНачислению КАК МКДКНачислению)
		|				И ПериодНачисления >= &НачалоУчетаДолга) КАК энргВзаиморасчетыПоМесяцамОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВзаиморасчетыПоМесяцамОстатки.Район,
		|	энргВзаиморасчетыПоМесяцамОстатки.МКД,
		|	энргВзаиморасчетыПоМесяцамОстатки.Абонент,
		|	энргВзаиморасчетыПоМесяцамОстатки.Услуга
		|
		|ИМЕЮЩИЕ
		|	СУММА(энргВзаиморасчетыПоМесяцамОстатки.СуммаОстаток) > 0" + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|"; 
		
	КонецЕсли;	
	
	Текст = Текст +  
	
	"ВЫБРАТЬ
	|	энргНастройкиРасчетаПениПоУслугамСрезПоследних.Организация КАК Организация,
	|	энргНастройкиРасчетаПениПоУслугамСрезПоследних.Район КАК Район,
	|	энргНастройкиРасчетаПениПоУслугамСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ УслугиБезПени
	|ИЗ
	|	РегистрСведений.энргНастройкиРасчетаПениПоУслугам.СрезПоследних(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И Район = &Район) КАК энргНастройкиРасчетаПениПоУслугамСрезПоследних
	|ГДЕ
	|	энргНастройкиРасчетаПениПоУслугамСрезПоследних.НеНачислятьПеню
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Район КАК Район,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.МКД КАК МКД,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Абонент КАК Абонент,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Услуга КАК Услуга,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.ПериодНачисления КАК ПериодНачисления,
	|	ВЫБОР
	|		КОГДА энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период МЕЖДУ &НачалоПериода И &ЗавершениеОП
	|			ТОГДА энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период
	|		ИНАЧЕ энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период
	|	КОНЕЦ КАК Период,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период, ДЕНЬ) = &ЗавершениеОП
	|				И энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Регистратор ССЫЛКА Документ.энргПерерасчет
	|			ТОГДА энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаКонечныйОстаток
	|		КОГДА КОНЕЦПЕРИОДА(энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Период, ДЕНЬ) = &ЗавершениеОП
	|			ТОГДА энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаКонечныйОстаток - энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаОборот
	|		ИНАЧЕ энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаКонечныйОстаток
	|	КОНЕЦ КАК СуммаКонечныйОстаток,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаОборот КАК СуммаОборот,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.Поставщик КАК Поставщик,
	|	энргВзаиморасчетыПоМесяцамОстаткиИОбороты.СуммаРасход КАК Оплата
	|ПОМЕСТИТЬ ДанныеЗадолженностиОсновнойНаборПолный
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.ОстаткиИОбороты(
	|			,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД В
	|						(ВЫБРАТЬ
	|							МКДКНачислению.МКД
	|						ИЗ
	|							МКДКНачислению КАК МКДКНачислению)
	|				И ПериодНачисления >= &НачалоУчетаДолга
	|				И НЕ Услуга В
	|						(ВЫБРАТЬ
	|							ВТ.Услуга
	|						ИЗ
	|							УслугиБезПени КАК ВТ)) КАК энргВзаиморасчетыПоМесяцамОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеЗадолженностиОсновнойНаборПолный.Абонент КАК Абонент
	|ПОМЕСТИТЬ УникальныеЛС
	|ИЗ
	|	ДанныеЗадолженностиОсновнойНаборПолный КАК ДанныеЗадолженностиОсновнойНаборПолный
	|;
	|/////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеЛССрезПоследних.Организация КАК Организация,
	|	энргСостояниеЛССрезПоследних.Район КАК Район,
	|	энргСостояниеЛССрезПоследних.Абонент КАК Абонент
	|ПОМЕСТИТЬ ВТ_СостояниеЛС
	|ИЗ
	|	РегистрСведений.энргСостояниеЛС.СрезПоследних(
	|			&НачалоПериода,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Абонент В
	|					(ВЫБРАТЬ
	|						ВТ.Абонент КАК Абонент
	|					ИЗ
	|						УникальныеЛС КАК ВТ)) КАК энргСостояниеЛССрезПоследних
	|ГДЕ
	|	энргСостояниеЛССрезПоследних.Состояние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргСостояниеЛС.Район КАК Район,
	|	энргСостояниеЛС.Абонент КАК Абонент,
	|	энргСостояниеЛС.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ЗакрытыеЛС
	|ИЗ
	|	РегистрСведений.энргСостояниеЛС КАК энргСостояниеЛС
	|ГДЕ
	|	энргСостояниеЛС.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И энргСостояниеЛС.Организация = &Организация
	|	И энргСостояниеЛС.Район = &Район
	|	И энргСостояниеЛС.Абонент В
	|			(ВЫБРАТЬ
	|				ВТ.Абонент КАК Абонент
	|			ИЗ
	|				ВТ_СостояниеЛС КАК ВТ)
	|	И НЕ энргСостояниеЛС.Состояние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадолженностиОсновнойНаборПолный.Район КАК Район,
	|	ДанныеЗадолженностиОсновнойНаборПолный.МКД КАК МКД,
	|	ДанныеЗадолженностиОсновнойНаборПолный.Абонент КАК Абонент,
	|	ДанныеЗадолженностиОсновнойНаборПолный.Услуга КАК Услуга,
	|	ДанныеЗадолженностиОсновнойНаборПолный.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеЗадолженностиОсновнойНаборПолный.Период КАК Период,
	|	ДанныеЗадолженностиОсновнойНаборПолный.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ДанныеЗадолженностиОсновнойНаборПолный.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ДанныеЗадолженностиОсновнойНаборПолный.СуммаОборот КАК СуммаОборот,
	|	ДанныеЗадолженностиОсновнойНаборПолный.Поставщик КАК Поставщик,
	|	ДанныеЗадолженностиОсновнойНаборПолный.Оплата КАК Оплата,
	|	ЕСТЬNULL(ВТ_ЗакрытыеЛС.Период, ДАТАВРЕМЯ(2150, 12, 31)) КАК ДатаЗакрытияЛС
	|ПОМЕСТИТЬ ДанныеЗадолженностиОсновнойНабор
	|ИЗ
	|	ДанныеЗадолженностиОсновнойНаборПолный КАК ДанныеЗадолженностиОсновнойНаборПолный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СостояниеЛС КАК ВТ_СостояниеЛС
	|		ПО ДанныеЗадолженностиОсновнойНаборПолный.Район = ВТ_СостояниеЛС.Район
	|			И ДанныеЗадолженностиОсновнойНаборПолный.Абонент = ВТ_СостояниеЛС.Абонент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗакрытыеЛС КАК ВТ_ЗакрытыеЛС
	|		ПО ДанныеЗадолженностиОсновнойНаборПолный.Район = ВТ_ЗакрытыеЛС.Район
	|			И ДанныеЗадолженностиОсновнойНаборПолный.Абонент = ВТ_ЗакрытыеЛС.Абонент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеЗадолженностиОсновнойНабор.Абонент КАК Абонент
	|ПОМЕСТИТЬ УникальныеОткрытыеЛС
	|ИЗ
	|	ДанныеЗадолженностиОсновнойНабор КАК ДанныеЗадолженностиОсновнойНабор
	|;
	|/////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Период КАК Период,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Организация КАК Организация,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Район КАК Район,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Абонент КАК Абонент,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.НеРассчитыватьПени КАК НеРассчитыватьПени
	|ПОМЕСТИТЬ ОстановкаРасчетаПениАбонентов
	|ИЗ
	|	РегистрСведений.энргОстановкаРасчетаПениАбонента.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Абонент В
	|					(ВЫБРАТЬ
	|						УникальныеОткрытыеЛС.Абонент КАК Абонент
	|					ИЗ
	|						УникальныеОткрытыеЛС КАК УникальныеОткрытыеЛС)
	|				И НеРассчитыватьПени) КАК энргОстановкаРасчетаПениАбонентаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Период КАК Период,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Организация КАК Организация,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Район КАК Район,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.Абонент КАК Абонент,
	|	энргОстановкаРасчетаПениАбонентаСрезПоследних.НеРассчитыватьПени КАК НеРассчитыватьПени
	|ПОМЕСТИТЬ ВосстановлениеРасчетаПениАбонентов
	|ИЗ
	|	РегистрСведений.энргОстановкаРасчетаПениАбонента.СрезПоследних(
	|			&КонецПериода,
	|			Организация = &Организация
	|				И Район = &Район
	|				И Абонент В
	|					(ВЫБРАТЬ
	|						УникальныеОткрытыеЛС.Абонент КАК Абонент
	|					ИЗ
	|						УникальныеОткрытыеЛС КАК УникальныеОткрытыеЛС)
	|				И НЕ НеРассчитыватьПени) КАК энргОстановкаРасчетаПениАбонентаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстановкаРасчетаПениАбонентов.Организация КАК Организация,
	|	ОстановкаРасчетаПениАбонентов.Район КАК Район,
	|	ОстановкаРасчетаПениАбонентов.Абонент КАК Абонент,
	|	НАЧАЛОПЕРИОДА(ОстановкаРасчетаПениАбонентов.Период, ДЕНЬ) КАК ПериодОстановкиРасчетаПени,
	|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ВосстановлениеРасчетаПениАбонентов.Период, ДЕНЬ), СЕКУНДА, -1), ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, -1)) КАК ПериодВозобновленияРасчетаПени,
	|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ОстановкаРасчетаПениАбонентов.Период, ДЕНЬ), ЕСТЬNULL(НАЧАЛОПЕРИОДА(ВосстановлениеРасчетаПениАбонентов.Период, ДЕНЬ), &КонецПериода), ДЕНЬ) КАК КоличествоДнейИсключения,
	|	ВЫБОР
	|		КОГДА ВосстановлениеРасчетаПениАбонентов.Период ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьВозобновление
	|ПОМЕСТИТЬ ПериодыОстановкиРасчетаПени
	|ИЗ
	|	ОстановкаРасчетаПениАбонентов КАК ОстановкаРасчетаПениАбонентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВосстановлениеРасчетаПениАбонентов КАК ВосстановлениеРасчетаПениАбонентов
	|		ПО ОстановкаРасчетаПениАбонентов.Организация = ВосстановлениеРасчетаПениАбонентов.Организация
	|			И ОстановкаРасчетаПениАбонентов.Район = ВосстановлениеРасчетаПениАбонентов.Район
	|			И ОстановкаРасчетаПениАбонентов.Абонент = ВосстановлениеРасчетаПениАбонентов.Абонент
	|			И ОстановкаРасчетаПениАбонентов.Период <= ВосстановлениеРасчетаПениАбонентов.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадолженности.Район КАК Район,
	|	ДанныеЗадолженности.МКД КАК МКД,
	|	ДанныеЗадолженности.Абонент КАК Абонент,
	|	ДанныеЗадолженности.Услуга КАК Услуга,
	|	ДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	|	МИНИМУМ(ДанныеЗадолженности.Период) КАК Период,
	|	ДанныеЗадолженности.Поставщик КАК Поставщик,
	|	ДанныеЗадолженности.ДатаЗакрытияЛС КАК ДатаЗакрытияЛС
	|ПОМЕСТИТЬ ДатаНачала
	|ИЗ
	|	ДанныеЗадолженностиОсновнойНабор КАК ДанныеЗадолженности
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеЗадолженности.Абонент,
	|	ДанныеЗадолженности.Услуга,
	|	ДанныеЗадолженности.ПериодНачисления,
	|	ДанныеЗадолженности.Район,
	|	ДанныеЗадолженности.МКД,
	|	ДанныеЗадолженности.Поставщик,
	|	ДанныеЗадолженности.ДатаЗакрытияЛС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеЗадолженности.Район КАК Район,
	|	ДанныеЗадолженности.МКД КАК МКД,
	|	ДанныеЗадолженности.Абонент КАК Абонент,
	|	ДанныеЗадолженности.Услуга КАК Услуга,
	|	ДанныеЗадолженности.ПериодНачисления КАК ПериодНачисления,
	|	ДанныеЗадолженности.Период КАК Период,
	|	ДанныеЗадолженности.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ДанныеЗадолженности.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ДатаНачала.Период КАК НачальныйПериод,
	|	ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ДатаНачала.Период, МЕСЯЦ), СЕКУНДА, 1), МЕСЯЦ, &ГлубинаОтсрочки), ДЕНЬ, &КрайнийСрокОплаты) КАК ДатаНачалаНачисленияПени,
	|	ДанныеЗадолженности.Поставщик КАК Поставщик,
	|	ДанныеЗадолженности.Оплата КАК Оплата,
	|	ДанныеЗадолженности.ДатаЗакрытияЛС КАК ДатаЗакрытияЛС
	|ПОМЕСТИТЬ ДатаНачальногоПериода
	|ИЗ
	|	ДанныеЗадолженностиОсновнойНабор КАК ДанныеЗадолженности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатаНачала КАК ДатаНачала
	|		ПО ДанныеЗадолженности.Район = ДатаНачала.Район
	|			И ДанныеЗадолженности.МКД = ДатаНачала.МКД
	|			И ДанныеЗадолженности.Абонент = ДатаНачала.Абонент
	|			И ДанныеЗадолженности.Услуга = ДатаНачала.Услуга
	|			И ДанныеЗадолженности.ПериодНачисления = ДатаНачала.ПериодНачисления"
	+ ?(НеНачислятьПениПриОтсутствииДолгаНаКонецПериода,
	"		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АбонентыСДолгамиНаКонецПериода КАК АбонентыСДолгамиНаКонецПериода
	|		ПО ДанныеЗадолженности.Район = АбонентыСДолгамиНаКонецПериода.Район
	|			И ДанныеЗадолженности.МКД = АбонентыСДолгамиНаКонецПериода.МКД
	|			И ДанныеЗадолженности.Абонент = АбонентыСДолгамиНаКонецПериода.Абонент
	|			И ДанныеЗадолженности.Услуга = АбонентыСДолгамиНаКонецПериода.Услуга", "")
	+ 
	"
	|ГДЕ
	|	ДанныеЗадолженности.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеЗадолженности.СуммаКонечныйОстаток >= 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(энргНачислениеПени.Ссылка) КАК Ссылка,
	|	энргНачислениеПени.Район КАК Район,
	|	энргНачислениеПени.МКД КАК МКД,
	|	энргНачислениеПени.ПометкаУдаления КАК ПометкаУдаления
	|ПОМЕСТИТЬ ДокументыНачисления
	|ИЗ
	|	Документ.энргНачислениеПени КАК энргНачислениеПени
	|ГДЕ
	|	энргНачислениеПени.Дата МЕЖДУ &НачалоПериода И &КонецПериодаДляДокумента
	|	И энргНачислениеПени.Организация = &Организация
	|	И энргНачислениеПени.Район = &Район
	|	И энргНачислениеПени.МКД В
	|			(ВЫБРАТЬ
	|				МКДКНачислению.МКД
	|			ИЗ
	|				МКДКНачислению КАК МКДКНачислению)
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНачислениеПени.Район,
	|	энргНачислениеПени.МКД,
	|	энргНачислениеПени.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатаНачальногоПериода.Район КАК Район,
	|	ДатаНачальногоПериода.МКД КАК МКД,
	|	ДатаНачальногоПериода.Абонент КАК Абонент,
	|	ДатаНачальногоПериода.Услуга КАК Услуга,
	|	ДатаНачальногоПериода.ПериодНачисления КАК ПериодНачисления,
	|	ДатаНачальногоПериода.Период КАК Период,
	|	ДатаНачальногоПериода.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ДатаНачальногоПериода.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ДатаНачальногоПериода.НачальныйПериод КАК НачальныйПериод,
	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПени,
	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПениДо,
	|	ДатаНачальногоПериода.Поставщик КАК Поставщик,
	|	ДатаНачальногоПериода.Оплата КАК Оплата,
	|	ДатаНачальногоПериода.ДатаЗакрытияЛС КАК ДатаЗакрытияЛС
	|ПОМЕСТИТЬ датыПериодаНов
	|ИЗ
	|	ДатаНачальногоПериода КАК ДатаНачальногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыОстановкиРасчетаПени КАК ПериодыОстановкиРасчетаПени
	|		ПО ДатаНачальногоПериода.Абонент = ПериодыОстановкиРасчетаПени.Абонент
	|			И ДатаНачальногоПериода.Район = ПериодыОстановкиРасчетаПени.Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ДокументыНачисления.Ссылка, ЗНАЧЕНИЕ(Документ.энргНачислениеПени.ПустаяСсылка)) КАК ДокументНачисления,
	|	ДатаНачальногоПериода.Абонент КАК Абонент,
	|	ДатаНачальногоПериода.Услуга КАК Услуга,
	|	ДатаНачальногоПериода.ПериодНачисления КАК ПериодНачисления,
	|	ДатаНачальногоПериода.Период КАК Период,
	|	ДатаНачальногоПериода.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ДатаНачальногоПериода.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПени,
	|	РАЗНОСТЬДАТ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1), МЕСЯЦ)
	|					И НАЧАЛОПЕРИОДА(ПериодыОстановкиРасчетаПени.ПериодВозобновленияРасчетаПени, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ)
	|				ТОГДА &КонецПериода
	|			КОГДА НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.Период, МЕСЯЦ)
	|				ТОГДА ДатаНачальногоПериода.ДатаНачалаНачисленияПени
	|			ИНАЧЕ &НачалоПериода
	|		КОНЕЦ, ДЕНЬ) - ЕСТЬNULL(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, ДЕНЬ, 30), МЕСЯЦ) = НАЧАЛОПЕРИОДА(ПериодыОстановкиРасчетаПени.ПериодОстановкиРасчетаПени, МЕСЯЦ)
	|				ТОГДА РАЗНОСТЬДАТ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, ПериодыОстановкиРасчетаПени.ПериодОстановкиРасчетаПени, ДЕНЬ)
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) - ЕСТЬNULL(ВЫБОР
	|			КОГДА НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.ДатаНачалаНачисленияПениДо, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ПериодыОстановкиРасчетаПени.ПериодВозобновленияРасчетаПени, МЕСЯЦ)
	|				ТОГДА РАЗНОСТЬДАТ(ПериодыОстановкиРасчетаПени.ПериодВозобновленияРасчетаПени, ДатаНачальногоПериода.ДатаНачалаНачисленияПениДо, ДЕНЬ)
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) + ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ПериодыОстановкиРасчетаПени.ПериодОстановкиРасчетаПени, МЕСЯЦ, -1), МЕСЯЦ)
	|				И ДатаНачальногоПериода.ДатаНачалаНачисленияПени < ПериодыОстановкиРасчетаПени.ПериодОстановкиРасчетаПени
	|			ТОГДА РАЗНОСТЬДАТ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, ПериодыОстановкиРасчетаПени.ПериодОстановкиРасчетаПени, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ + ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.ДатаНачалаНачисленияПениДо, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ПериодыОстановкиРасчетаПени.ПериодВозобновленияРасчетаПени, МЕСЯЦ)
	|				И ДатаНачальногоПериода.ДатаНачалаНачисленияПени > ДОБАВИТЬКДАТЕ(ПериодыОстановкиРасчетаПени.ПериодОстановкиРасчетаПени, ДЕНЬ, -30)
	|			ТОГДА РАЗНОСТЬДАТ(ПериодыОстановкиРасчетаПени.ПериодВозобновленияРасчетаПени, ДатаНачальногоПериода.ДатаНачалаНачисленияПениДо, ДЕНЬ)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДнейНаДеньНачала,
	|	РАЗНОСТЬДАТ(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, ДатаНачальногоПериода.Период, ДЕНЬ) КАК ДнейПросрочкиСДатыНачалаНачисленийПени,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.ДатаНачалаНачисленияПени, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ДатаНачальногоПериода.Период, МЕСЯЦ)
	|			ТОГДА ДатаНачальногоПериода.ДатаНачалаНачисленияПени
	|		ИНАЧЕ &НачалоПериода
	|	КОНЕЦ КАК ПериодНачало,
	|	ДатаНачальногоПериода.НачальныйПериод КАК НачальныйПериод,
	|	ЕСТЬNULL(ПериодДействияСтавокРефинансирования.ЗначениеСтавкиРефинансирования, 0) КАК ЗначениеСтавкиРефинансирования,
	|	ДОБАВИТЬКДАТЕ(&ЗавершениеОП, СЕКУНДА, 1) КАК ДатаНачисленияПени,
	|	ДатаНачальногоПериода.Поставщик КАК Поставщик,
	|	ПериодыОстановкиРасчетаПени.ПериодОстановкиРасчетаПени КАК ПериодОстановкиРасчетаПени,
	|	ПериодыОстановкиРасчетаПени.ПериодВозобновленияРасчетаПени КАК ПериодВозобновленияРасчетаПени,
	|	ДатаНачальногоПериода.Оплата КАК Оплата,
	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПениДо КАК ДатаНачалаНачисленияПениДо,
	|	ПериодыОстановкиРасчетаПени.КоличествоДнейИсключения КАК КоличествоДнейИсключения,
	|	ДатаНачальногоПериода.ДатаЗакрытияЛС КАК ДатаЗакрытияЛС,
	|	ДатаНачальногоПериода.МКД КАК МКД
	|ПОМЕСТИТЬ ИтоговыеДанные
	|ИЗ
	|	датыПериодаНов КАК ДатаНачальногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыНачисления КАК ДокументыНачисления
	|		ПО ДатаНачальногоПериода.Район = ДокументыНачисления.Район
	|			И ДатаНачальногоПериода.МКД = ДокументыНачисления.МКД
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтавкиНаПериод КАК ПериодДействияСтавокРефинансирования
	|		ПО (ВЫБОР
	|				КОГДА НЕ &РасчетПоТекущейСтавке
	|					ТОГДА ПериодДействияСтавокРефинансирования.ПериодС < ДатаНачальногоПериода.Период
	|							И ДатаНачальногоПериода.Период <= ПериодДействияСтавокРефинансирования.ПериодПо
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ДатаНачальногоПериода.Период = &КонецПериода
	|							ТОГДА ПериодДействияСтавокРефинансирования.ПериодПо = ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 1)
	|						ИНАЧЕ ПериодДействияСтавокРефинансирования.ПериодС < ДатаНачальногоПериода.Период
	|								И ДатаНачальногоПериода.Период <= ПериодДействияСтавокРефинансирования.ПериодПо
	|					КОНЕЦ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПериодыОстановкиРасчетаПени КАК ПериодыОстановкиРасчетаПени
	|		ПО ДатаНачальногоПериода.Абонент = ПериодыОстановкиРасчетаПени.Абонент
	|			И ДатаНачальногоПериода.Район = ПериодыОстановкиРасчетаПени.Район
	|ГДЕ
	|	ДатаНачальногоПериода.ДатаНачалаНачисленияПени < &КонецПериода
	|	И ДатаНачальногоПериода.Период >= ДатаНачальногоПериода.ДатаНачалаНачисленияПени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговыеДанные.МКД КАК МКД,
	|	ИтоговыеДанные.ДокументНачисления КАК ДокументНачисления,
	|	ИтоговыеДанные.Абонент КАК Абонент,
	|	ИтоговыеДанные.Услуга КАК Услуга,
	|	ИтоговыеДанные.ПериодНачисления КАК ПериодНачисления,
	|	ИтоговыеДанные.Период КАК Период,
	|	ИтоговыеДанные.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ИтоговыеДанные.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ИтоговыеДанные.ДатаНачалаНачисленияПени КАК ДатаНачалаНачисленияПени,
	|	ИтоговыеДанные.ДнейНаДеньНачала КАК ДнейНаДеньНачала,
	|	ИтоговыеДанные.ДнейПросрочкиСДатыНачалаНачисленийПени КАК ДнейПросрочкиСДатыНачалаНачисленийПени,
	|	ИтоговыеДанные.ПериодНачало КАК ПериодНачало,
	|	ИтоговыеДанные.НачальныйПериод КАК НачальныйПериод,
	|	ИтоговыеДанные.ЗначениеСтавкиРефинансирования КАК ЗначениеСтавкиРефинансирования,
	|	ИтоговыеДанные.ДатаНачисленияПени КАК ДатаНачисленияПени,
	|	ИтоговыеДанные.Поставщик КАК Поставщик,
	|	ИтоговыеДанные.ПериодОстановкиРасчетаПени КАК ПериодОстановкиРасчетаПени,
	|	ИтоговыеДанные.ПериодВозобновленияРасчетаПени КАК ПериодВозобновленияРасчетаПени,
	|	ИтоговыеДанные.Оплата КАК Оплата,
	|	ИтоговыеДанные.ДатаНачалаНачисленияПениДо КАК ДатаНачалаНачисленияПениДо,
	|	ИтоговыеДанные.КоличествоДнейИсключения КАК КоличествоДнейИсключения,
	|	ИтоговыеДанные.ДатаЗакрытияЛС КАК ДатаЗакрытияЛС,
	|	ИСТИНА КАК ЕстьНачисления
	|ИЗ
	|	ИтоговыеДанные КАК ИтоговыеДанные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МКДКНачислению.МКД,
	|	ДокументыНачисления.Ссылка,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ЛОЖЬ КАК ЕстьНачисления
	|ИЗ
	|	МКДКНачислению КАК МКДКНачислению
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ИтоговыеДанные.МКД КАК МКД
	|		ИЗ
	|			ИтоговыеДанные КАК ИтоговыеДанные) КАК ИтоговыеДанныеУникальныеМКД
	|		ПО МКДКНачислению.МКД = ИтоговыеДанныеУникальныеМКД.МКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыНачисления КАК ДокументыНачисления
	|		ПО (ДокументыНачисления.Район = &Район)
	|			И МКДКНачислению.МКД = ДокументыНачисления.МКД
	|ГДЕ
	|	ИтоговыеДанныеУникальныеМКД.МКД ЕСТЬ NULL
	|ИТОГИ
	|	МАКСИМУМ(ДнейНаДеньНачала),
	|	МАКСИМУМ(ЕстьНачисления),
	|	МАКСИМУМ(ПериодНачало)
	|ПО
	|	МКД,
	|	ДокументНачисления,
	|	ПериодНачисления,
	|	Услуга,
	|	Абонент";
	
	
	Возврат Текст;
	
КонецФункции

Функция РезультатЗапросаМКД(МКДКНачислению)
	
	ОсновнойЗапрос.УстановитьПараметр("ГлубинаОтсрочки", 			ГлубинаОтсрочки);
	ОсновнойЗапрос.УстановитьПараметр("КонецПериода", 				ГраницыПериодаНачисления.ЗавершениеОП);
	ОсновнойЗапрос.УстановитьПараметр("КонецПериодаДляДокумента",	КонецПериода - 1);
	ОсновнойЗапрос.УстановитьПараметр("КрайнийСрокОплаты", 			КрайнийСрокОплаты);
	ОсновнойЗапрос.УстановитьПараметр("НачалоПериода", 				ГраницыПериодаНачисления.НачалоОП);
	ОсновнойЗапрос.УстановитьПараметр("Организация", 				Организация);
	ОсновнойЗапрос.УстановитьПараметр("Район", 						Район);
	ОсновнойЗапрос.УстановитьПараметр("НачалоУчетаДолга", 			НачалоУчетаДолга);
	ОсновнойЗапрос.УстановитьПараметр("РасчетПоТекущейСтавке", 		РасчетПоТекущейСтавке);
	ОсновнойЗапрос.УстановитьПараметр("ЗавершениеОП", 				ГраницыПериодаНачисления.ЗавершениеОП - 1);
	ОсновнойЗапрос.УстановитьПараметр("ТаблицаСтавкиНаПериод", 		СтавкиНаПериод);
	ОсновнойЗапрос.УстановитьПараметр("МКДКНачислению", 			МКДКНачислению);
	
	РезультатЗапроса = ОсновнойЗапрос.Выполнить();
	Возврат РезультатЗапроса;

КонецФункции 

#КонецОбласти

#Область ПроцессРасчетаПени

Процедура Начислить()
	
	РезультатЗапроса = РезультатЗапросаМКД(МКДКНачислению);
	ВыборкаМКД = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Всего = ВыборкаМКД.Количество();
	Итерация			= 0;
	КоличествоИтераций 	= Итерация;
	КолвоСообщений		= Цел(Всего / 20);
	Постфикс 			= " из " + Всего;
	
	Пока ВыборкаМКД.Следующий() Цикл 
		
		Если НЕ ВыборкаМКД.ЕстьНачисления Тогда
			
			ОтменитьОперациюНачисленийПени(ВыборкаМКД);
			Итерация = Итерация + 1;
			КоличествоИтераций = КоличествоИтераций + 1;			
			Продолжить;
			
		КонецЕсли;		
		
		ОбработатьРезультатЗапросаМКД(ВыборкаМКД);
		
		Если КоличествоИтераций = КолвоСообщений Тогда
			ЗаписьЖурналаРегистрации(
			"Начисление пени." + ПредставлениеРайон,
			УровеньЖурналаРегистрации.Примечание,,,
			"Начислено " + Итерация + Постфикс);
			
			КоличествоИтераций = 0;
		КонецЕсли;
		
		Итерация = Итерация + 1;
		КоличествоИтераций = КоличествоИтераций + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НачислитьЧастныйСектор()
	
	РазрешеноДействие = Ложь;
	Если МКД = Неопределено Тогда
		РазрешеноДействие = Истина;
	ИначеЕсли ТипЗнч(МКД) = Тип("СправочникСсылка.энргСтроения") И МКД = Справочники.энргСтроения.ПустаяСсылка() Тогда
		РазрешеноДействие = Истина;
	ИначеЕсли ТипЗнч(МКД) = Тип("Массив") И МКД.Количество() = 1 И МКД[0] = Справочники.энргСтроения.ПустаяСсылка() Тогда
		РазрешеноДействие = Истина;	
	КонецЕсли;
	
	Если Не РазрешеноДействие Тогда
		Возврат;
	КонецЕсли;	
	
	МКДКНачислению.Очистить();
	
	НоваяСтрока = МКДКНачислению.Добавить();
	НоваяСтрока.МКД = Справочники.энргСтроения.ПустаяСсылка();
	НоваяСтрока.Код = 0;
	НоваяСтрока.Наименование = "ЧастныйСектор";		
	
	Начислить();
	
КонецПроцедуры

Процедура ОбработатьРезультатЗапросаМКД(ВыборкаМКД)
	
	ТекущийМКД = ВыборкаМКД.МКД;
	СменаСтавкиВПериоде = СменаСтавкиВПериодеСтатика;	
	НаборНачислениеПени = Неопределено;
	ДокументОбъект = Неопределено; 	
		
	ВыборкаДокументНачисления = ВыборкаМКД.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
	Пока ВыборкаДокументНачисления.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДокументНачисления.ДокументНачисления) Тогда			
			ДокументОбъект = ВыборкаДокументНачисления.ДокументНачисления.ПолучитьОбъект();
			ДокументСсылка = ДокументОбъект.Ссылка;
		иначе
			ДокументСсылка = Документы.энргНачислениеПени.ПолучитьСсылку(Новый УникальныйИдентификатор());
			ДокументОбъект = Документы.энргНачислениеПени.СоздатьДокумент();
			ДокументОбъект.УстановитьСсылкуНового(ДокументСсылка);
			ДокументОбъект.Район = Район;
			ДокументОбъект.МКД = ТекущийМКД;
			ДокументОбъект.Организация = Организация;
			ДокументОбъект.ПериодНачисления = ПериодНачисления;
		КонецЕсли;
		
		ДокументОбъект.Дата = КонецПериода - 1;		
		ДокументОбъект.ПометкаУдаления = Ложь;		
		
		НаборНачислениеПени	= энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыНакопления.энргНачислениеПени);
		НаборНачислениеПени.Отбор.Регистратор.Установить(ДокументСсылка);
		
		ВыборкаПериодНачисления = ВыборкаДокументНачисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Пока ВыборкаПериодНачисления.Следующий() Цикл
			
			ВыборкаУслуга = ВыборкаПериодНачисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
			Пока ВыборкаУслуга.Следующий() Цикл
				ВыборкаАбонент = ВыборкаУслуга.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
				Пока ВыборкаАбонент.Следующий() Цикл
					
					НачалоПериода 				= ВыборкаАбонент.ПериодНачало;
					ПериодНачалоДляРасчета 		= ВыборкаАбонент.ПериодНачало;
					ДнейНаДеньНачалаДляРасчета 	= ?(ВыборкаАбонент.ДнейНаДеньНачала = 0, -1, ВыборкаАбонент.ДнейНаДеньНачала);
					ТекПериод 					= ВыборкаАбонент.ПериодНачало;						
					СуммаПени 					= 0;
					ДнейПросрочкиВПериоде 		= 0;
					ДнейПросрочки 				= ВыборкаАбонент.ДнейНаДеньНачала;
					Оплата 						= 0;
					
					ВыборкаДетальныеЗаписи = ВыборкаАбонент.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 						
						СуммаЗадолженности = ?(ВыборкаДетальныеЗаписи.СуммаНачальныйОстаток = 0, ВыборкаДетальныеЗаписи.СуммаКонечныйОстаток, ВыборкаДетальныеЗаписи.СуммаНачальныйОстаток);
						КоэффициентЧислитель = 1;
						КоэффициентЗнаменатель = 1;
						ПредКоэффициентЧислитель = 1;
						ПредКоэффициентЗнаменатель = 1;
						РангКоэффициента = 0;
						ПредыдущийРанг = Неопределено;
						НачисляемПеню = Ложь;  						
						
						ЗначениеСтавкиРефинансирования = ВыборкаДетальныеЗаписи.ЗначениеСтавкиРефинансирования;
						ПричинаСменаСтавкиВПериоде = Ложь;
						
						Если СменаСтавкиВПериоде.ЕстьСмена и СменаСтавкиВПериоде.Период < ТекПериод Тогда 
							ЗначениеСтавкиРефинансирования = СменаСтавкиВПериоде.Коэффициент;
						КонецЕсли;
						
						Пока НачалоДня(ТекПериод) < НачалоДня(ВыборкаДетальныеЗаписи.Период) И НачалоДня(ТекПериод) < НачалоДня(ВыборкаДетальныеЗаписи.ДатаЗакрытияЛС) Цикл
							
							ДнейПросрочки = ДнейПросрочки + 1;							
							НачисляемПеню = Ложь;
							ПараметрыРасчетаИзменены = Ложь;
							Мораторий = Ложь;
							
							КлючДняПросрочки = ?(ДнейПросрочки > МаксЗначениеСтатика, 0, ДнейПросрочки);						
							СтруктураКоэффициента = НастройкиРасчетаПениОтДо.Получить(КлючДняПросрочки);
							
							Если НЕ СтруктураКоэффициента = Неопределено Тогда
								ПараметрыРасчетаИзменены = НЕ КоэффициентЧислитель = СтруктураКоэффициента.Числитель ИЛИ НЕ КоэффициентЗнаменатель = СтруктураКоэффициента.Знаменатель ИЛИ НЕ РангКоэффициента = СтруктураКоэффициента.РангКоэффициента;  
								НачисляемПеню = Истина;								
							КонецЕсли;
							
							Если РассчитыватьНаТекущуюДату И ТекПериод = НачалоСледующегоДняПослеТекущейДатыНачислений Тогда
								ПараметрыРасчетаИзменены = Истина;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПериодОстановкиРасчетаПени) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПериодВозобновленияРасчетаПени) Тогда
								Если ТекПериод >= НачалоДня(ВыборкаДетальныеЗаписи.ПериодОстановкиРасчетаПени) И ТекПериод < НачалоДня(ВыборкаДетальныеЗаписи.ПериодВозобновленияРасчетаПени + 1) Тогда	
									Мораторий = Истина;	
								КонецЕсли;
							КонецЕсли;
							
							Если НачисляемПеню и СменаСтавкиВПериоде.ЕстьСмена и ТекПериод = СменаСтавкиВПериоде.Период Тогда								
								ПараметрыРасчетаИзменены = Истина;
								ПричинаСменаСтавкиВПериоде = Истина;
							КонецЕсли; 						
							
							
							Если НачисляемПеню и ПараметрыРасчетаИзменены И ДнейПросрочкиВПериоде > 1 Тогда
								
								НСтр = НаборНачислениеПени.Добавить();
								ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
								НСтр.Организация			= Организация;
								НСтр.Район					= Район;
								НСтр.МКД					= ТекущийМКД;
								НСтр.ПериодРасчета			= ПериодНачисления;
								НСтр.Период					= ДокументОбъект.Дата; 
								НСтр.ДатаНачисленияПени 	= ТекПериод;
								НСтр.ДнейПросрочкиСДатыНачалаНачисленийПени = ДнейПросрочки - 1;
								НСтр.КоэффициентЧислитель 	= КоэффициентЧислитель;
								НСтр.КоэффициентЗнаменатель = КоэффициентЗнаменатель;
								НСтр.СуммаЗадолженности 	= СуммаЗадолженности;
								НСтр.ДнейПросрочки 			= ДнейПросрочкиВПериоде;
								НСтр.СтавкаРефинансирования = ЗначениеСтавкиРефинансирования;
								НСтр.Сумма 					= СуммаПени;
								НСтр.Оплата	 				= 0;
								НСтр.НачалоПериода 			= НачалоПериода;
								НСтр.КонецПериода 			= ТекПериод - 1;
								
								Если ПричинаСменаСтавкиВПериоде Тогда 
									ЗначениеСтавкиРефинансирования = СменаСтавкиВПериоде.Коэффициент;
								КонецЕсли;
								
								СуммаПени 					= 0;								
								ДнейПросрочкиВПериоде 		= 0;
								НСтр.ДатаНачалаНачисленияПени = ВыборкаДетальныеЗаписи.ДатаНачалаНачисленияПени;
								
								НачалоПериода 	= ТекПериод;
							КонецЕсли; 
							
							Если НЕ СтруктураКоэффициента = Неопределено Тогда
								КоэффициентЧислитель 		= СтруктураКоэффициента.Числитель;
								КоэффициентЗнаменатель 		= СтруктураКоэффициента.Знаменатель;
								РангКоэффициента 			= СтруктураКоэффициента.РангКоэффициента; 								
							КонецЕсли;
							
							Если НачисляемПеню Тогда
								
								СтавкаРефинансированияДоля	= (ЗначениеСтавкиРефинансирования/100);
								
								Если Не Мораторий Тогда
									СуммаПени = СуммаПени + СуммаЗадолженности * (КоэффициентЧислитель / КоэффициентЗнаменатель) * СтавкаРефинансированияДоля;
									ДнейПросрочкиВПериоде = ДнейПросрочкиВПериоде + 1;
								Иначе
									СуммаПени = СуммаПени + 0;
									ДнейПросрочкиВПериоде = ДнейПросрочкиВПериоде + 0;
								КонецЕсли;
								
							КонецЕсли;
							
							ТекПериод = ТекПериод + 86400;							
						КонецЦикла;
						
						Если НачисляемПеню и СуммаПени > 0  и Не ДнейПросрочки = 0  Тогда
							НСтр = НаборНачислениеПени.Добавить();
							ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
							НСтр.Период					= ДокументОбъект.Дата; 
							НСтр.Организация			= Организация;
							НСтр.Район					= Район;
							НСтр.МКД					= ТекущийМКД;
							НСтр.ПериодРасчета			= ПериодНачисления;							
							НСтр.ДатаНачисленияПени 	= ТекПериод;										
							НСтр.ДатаНачалаНачисленияПени = ВыборкаДетальныеЗаписи.ДатаНачалаНачисленияПени;
							
							НСтр.ДнейПросрочкиСДатыНачалаНачисленийПени = ДнейПросрочки;
							НСтр.КоэффициентЧислитель 	= КоэффициентЧислитель;
							НСтр.КоэффициентЗнаменатель = КоэффициентЗнаменатель;
							НСтр.СуммаЗадолженности 	= СуммаЗадолженности;
							НСтр.ДнейПросрочки 			= ДнейПросрочкиВПериоде;
							НСтр.СтавкаРефинансирования = ЗначениеСтавкиРефинансирования;							
							НСтр.Сумма 					= СуммаПени;
							НСтр.НачалоПериода 			= НачалоПериода;
							НСтр.КонецПериода 			= ТекПериод - 1;
							
							СуммаПени 					= 0;								
							ДнейПросрочкиВПериоде 		= 0;
							
						КонецЕсли;
						
						Если Не НачисляемПеню И СтруктураКоэффициента = Неопределено И ВыборкаДетальныеЗаписи.ПериодНачало = ПериодНачисления Тогда 
							
							НСтр = НаборНачислениеПени.Добавить();
							ЗаполнитьЗначенияСвойств(НСтр, ВыборкаДетальныеЗаписи);
							НСтр.Период					= ДокументОбъект.Дата; 
							НСтр.Организация			= Организация;
							НСтр.Район					= Район;
							НСтр.МКД					= ТекущийМКД;
							НСтр.ПериодРасчета			= ПериодНачисления;
							НСтр.ДатаНачисленияПени 	= Дата(1,1,1) ;				
							НСтр.ДатаНачалаНачисленияПени = Дата(1,1,1);						
							НСтр.ДнейПросрочкиСДатыНачалаНачисленийПени = ДнейПросрочки;
							НСтр.КоэффициентЧислитель 	= 0;
							НСтр.КоэффициентЗнаменатель = 0;
							НСтр.СуммаЗадолженности 	= СуммаЗадолженности;
							НСтр.ДнейПросрочки 			= 0;
							НСтр.СтавкаРефинансирования = 0;							
							НСтр.Сумма	 				= 0;
							НСтр.Оплата	 				= 0;
							НСтр.НачалоПериода 			= НачалоПериода;
							НСтр.КонецПериода 			= ТекПериод - 1;
							
						КонецЕсли;
						
						НачалоПериода 	= ТекПериод;
						Оплата 			= ВыборкаДетальныеЗаписи.Оплата;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;	
		
	КонецЦикла;
	
	//// Проверка изменения настроек в периоде. При условии, что "РасчетПоТекущейСтавке" = Истина
	//Если РасчетПоТекущейСтавке Тогда
	//	СнятьНачислениеПени(НовНабор, Организация, ГраницыПериодаНачисления.НачалоОП, ГраницыПериодаНачисления.ЗавершениеОП-1, ПериодНачисления, МКД, Район);
	//	ДоначислитьСуммыПени(НовНабор, Организация, ПериодНачисления,Район, МКД, ГраницыПериодаНачисления.НачалоОП, ГраницыПериодаНачисления.ЗавершениеОП, ГлубинаОтсрочки, КрайнийСрокОплаты, НачалоУчетаДолга, НачалоРасчетаПени);
	//КонецЕсли;
	
	Если ДокументОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ДокументОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);	
	ДокументОбъект.Движения.энргНачислениеПени.Загрузить(НаборНачислениеПени.Выгрузить());
	
	НаборАвансыИспользованные	= энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыНакопления.энргАвансыИспользованные);
	НаборАвансыИспользованные.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборАвансы	= энргОбщегоНазначения.СоздатьНаборЗаписейСДополнительнымиПараметрами(РегистрыНакопления.энргАвансы);
	НаборАвансы.Отбор.Регистратор.Установить(ДокументСсылка);
	
	НачатьТранзакцию();
	Попытка			
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		НаборНачислениеПени.Записать();
		НаборАвансыИспользованные.Записать();
		НаборАвансы.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Инфо = ИнформацияОбОшибке();
		Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(Инфо);
		
		Комментарий = СтрШаблон(
			"Код строения: %1
			|Строение: %2
			|Ошибка: %3", 
			ТекущийМКД.Код,
			ТекущийМКД.Наименование,
			Ошибка);
		
		ЗаписьЖурналаРегистрации(
		"Начисление пени",
		УровеньЖурналаРегистрации.Ошибка,,,
		Комментарий);		
			
		Ошибки.Добавить(Комментарий);
		
	КонецПопытки;	
	
КонецПроцедуры

Процедура ОтменитьОперациюНачисленийПени(ВыборкаМКД)
	
	Если НЕ ЗначениеЗаполнено(ВыборкаМКД.ДокументНачисления) Тогда 
		Возврат;
	КонецЕсли;  
	
	ДокументОбъектОтменить = ВыборкаМКД.ДокументНачисления.ПолучитьОбъект();
	Попытка			
		
		ДокументОбъектОтменить.УстановитьПометкуУдаления(Истина);
		
	Исключение
			
		Инфо = ИнформацияОбОшибке();
		Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(Инфо);
		
		Комментарий = СтрШаблон(
			"Код строения: %1
			|Строение: %2
			|Ошибка: %3", 
			ВыборкаМКД.МКД.Код,
			ВыборкаМКД.МКД.Наименование,
			Ошибка);
		
		ЗаписьЖурналаРегистрации(
		"Начисление пени",
		УровеньЖурналаРегистрации.Ошибка,,,
		Комментарий);		
			
		Ошибки.Добавить(Комментарий);
		
	КонецПопытки;
			
КонецПроцедуры

#КонецОбласти

#КонецОбласти
